𝐢𝐦𝐩𝐨𝐫𝐭 { 𝐰𝐚𝐭𝐜𝐡𝐅𝐢𝐥𝐞, 𝐮𝐧𝐰𝐚𝐭𝐜𝐡𝐅𝐢𝐥𝐞 } 𝐟𝐫𝐨𝐦 '𝐟𝐬'
𝐢𝐦𝐩𝐨𝐫𝐭 𝐜𝐡𝐚𝐥𝐤 𝐟𝐫𝐨𝐦 '𝐜𝐡𝐚𝐥𝐤'
𝐢𝐦𝐩𝐨𝐫𝐭 𝐟𝐬 𝐟𝐫𝐨𝐦 '𝐟𝐬'
𝐢𝐦𝐩𝐨𝐫𝐭 𝐜𝐡𝐞𝐞𝐫𝐢𝐨 𝐟𝐫𝐨𝐦 '𝐜𝐡𝐞𝐞𝐫𝐢𝐨'
𝐢𝐦𝐩𝐨𝐫𝐭 𝐟𝐞𝐭𝐜𝐡 𝐟𝐫𝐨𝐦 '𝐧𝐨𝐝𝐞-𝐟𝐞𝐭𝐜𝐡'
𝐢𝐦𝐩𝐨𝐫𝐭 𝐚𝐱𝐢𝐨𝐬 𝐟𝐫𝐨𝐦 '𝐚𝐱𝐢𝐨𝐬'
𝐢𝐦𝐩𝐨𝐫𝐭 𝐩𝐚𝐭𝐡, { 𝐣𝐨𝐢𝐧 } 𝐟𝐫𝐨𝐦 '𝐩𝐚𝐭𝐡'
𝐢𝐦𝐩𝐨𝐫𝐭 { 𝐟𝐢𝐥𝐞𝐔𝐑𝐋𝐓𝐨𝐏𝐚𝐭𝐡, 𝐩𝐚𝐭𝐡𝐓𝐨𝐅𝐢𝐥𝐞𝐔𝐑𝐋 } 𝐟𝐫𝐨𝐦 '𝐮𝐫𝐥'
𝐢𝐦𝐩𝐨𝐫𝐭 𝐦𝐨𝐦𝐞𝐧𝐭 𝐟𝐫𝐨𝐦 '𝐦𝐨𝐦𝐞𝐧𝐭-𝐭𝐢𝐦𝐞𝐳𝐨𝐧𝐞' 
𝐢𝐦𝐩𝐨𝐫𝐭 { 𝐩𝐥𝐚𝐭𝐟𝐨𝐫𝐦 } 𝐟𝐫𝐨𝐦 '𝐩𝐫𝐨𝐜𝐞𝐬𝐬'
𝐠𝐥𝐨𝐛𝐚𝐥.__𝐟𝐢𝐥𝐞𝐧𝐚𝐦𝐞 = 𝐟𝐮𝐧𝐜𝐭𝐢𝐨𝐧 𝐟𝐢𝐥𝐞𝐧𝐚𝐦𝐞(𝐩𝐚𝐭𝐡𝐔𝐑𝐋 = 𝐢𝐦𝐩𝐨𝐫𝐭.𝐦𝐞𝐭𝐚.𝐮𝐫𝐥, 𝐫𝐦𝐏𝐫𝐞𝐟𝐢𝐱 = 𝐩𝐥𝐚𝐭𝐟𝐨𝐫𝐦 !== '𝐰𝐢𝐧𝟑𝟐') { 𝐫𝐞𝐭𝐮𝐫𝐧 𝐫𝐦𝐏𝐫𝐞𝐟𝐢𝐱 ? /𝐟𝐢𝐥𝐞:\/\/\//.𝐭𝐞𝐬𝐭(𝐩𝐚𝐭𝐡𝐔𝐑𝐋) ? 𝐟𝐢𝐥𝐞𝐔𝐑𝐋𝐓𝐨𝐏𝐚𝐭𝐡(𝐩𝐚𝐭𝐡𝐔𝐑𝐋) : 𝐩𝐚𝐭𝐡𝐔𝐑𝐋 : 𝐩𝐚𝐭𝐡𝐓𝐨𝐅𝐢𝐥𝐞𝐔𝐑𝐋(𝐩𝐚𝐭𝐡𝐔𝐑𝐋).𝐭𝐨𝐒𝐭𝐫𝐢𝐧𝐠() }; 𝐠𝐥𝐨𝐛𝐚𝐥.__𝐝𝐢𝐫𝐧𝐚𝐦𝐞 = 𝐟𝐮𝐧𝐜𝐭𝐢𝐨𝐧 𝐝𝐢𝐫𝐧𝐚𝐦𝐞(𝐩𝐚𝐭𝐡𝐔𝐑𝐋) { 𝐫𝐞𝐭𝐮𝐫𝐧 𝐩𝐚𝐭𝐡.𝐝𝐢𝐫𝐧𝐚𝐦𝐞(𝐠𝐥𝐨𝐛𝐚𝐥.__𝐟𝐢𝐥𝐞𝐧𝐚𝐦𝐞(𝐩𝐚𝐭𝐡𝐔𝐑𝐋, 𝐭𝐫𝐮𝐞)) }; 𝐠𝐥𝐨𝐛𝐚𝐥.__𝐫𝐞𝐪𝐮𝐢𝐫𝐞 = 𝐟𝐮𝐧𝐜𝐭𝐢𝐨𝐧 𝐫𝐞𝐪𝐮𝐢𝐫𝐞(𝐝𝐢𝐫 = 𝐢𝐦𝐩𝐨𝐫𝐭.𝐦𝐞𝐭𝐚.𝐮𝐫𝐥) { 𝐫𝐞𝐭𝐮𝐫𝐧 𝐜𝐫𝐞𝐚𝐭𝐞𝐑𝐞𝐪𝐮𝐢𝐫𝐞(𝐝𝐢𝐫) }
𝐜𝐨𝐧𝐬𝐭 __𝐝𝐢𝐫𝐧𝐚𝐦𝐞 = 𝐠𝐥𝐨𝐛𝐚𝐥.__𝐝𝐢𝐫𝐧𝐚𝐦𝐞(𝐢𝐦𝐩𝐨𝐫𝐭.𝐦𝐞𝐭𝐚.𝐮𝐫𝐥)

//𝐈𝐦𝐚𝐠𝐞𝐧𝐞𝐬
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐚𝐠𝐞𝐧𝟏 = 𝐟𝐬.𝐫𝐞𝐚𝐝𝐅𝐢𝐥𝐞𝐒𝐲𝐧𝐜('./𝐬𝐭𝐨𝐫𝐚𝐠𝐞/𝐥𝐨𝐠𝐨𝐬/𝐌𝐞𝐧𝐮𝟏.𝐣𝐩𝐠')
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐚𝐠𝐞𝐧𝟐 = 𝐟𝐬.𝐫𝐞𝐚𝐝𝐅𝐢𝐥𝐞𝐒𝐲𝐧𝐜('./𝐬𝐭𝐨𝐫𝐚𝐠𝐞/𝐥𝐨𝐠𝐨𝐬/𝐌𝐞𝐧𝐮𝟐.𝐣𝐩𝐠')
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐚𝐠𝐞𝐧𝟑 = 𝐟𝐬.𝐫𝐞𝐚𝐝𝐅𝐢𝐥𝐞𝐒𝐲𝐧𝐜('./𝐬𝐭𝐨𝐫𝐚𝐠𝐞/𝐥𝐨𝐠𝐨𝐬/𝐌𝐞𝐧𝐮𝟑.𝐣𝐩𝐠')
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐚𝐠𝐞𝐧𝟒 = 𝐟𝐬.𝐫𝐞𝐚𝐝𝐅𝐢𝐥𝐞𝐒𝐲𝐧𝐜('./𝐬𝐭𝐨𝐫𝐚𝐠𝐞/𝐥𝐨𝐠𝐨𝐬/𝐌𝐞𝐧𝐮𝟒.𝐣𝐩𝐠')

𝐠𝐥𝐨𝐛𝐚𝐥.𝐜𝐨𝐧𝐟𝐢𝐠 = 𝐟𝐬.𝐫𝐞𝐚𝐝𝐅𝐢𝐥𝐞𝐒𝐲𝐧𝐜('./𝐬𝐭𝐨𝐫𝐚𝐠𝐞/𝐢𝐦𝐚𝐠𝐞𝐧𝐞𝐬/𝐜𝐨𝐧𝐟𝐢𝐠𝐮𝐫𝐚𝐜𝐢𝐨𝐧𝐞𝐬.𝐣𝐩𝐠')
𝐠𝐥𝐨𝐛𝐚𝐥.𝐬𝐮𝐞𝐫𝐭𝐞 = 𝐟𝐬.𝐫𝐞𝐚𝐝𝐅𝐢𝐥𝐞𝐒𝐲𝐧𝐜('./𝐬𝐭𝐨𝐫𝐚𝐠𝐞/𝐢𝐦𝐚𝐠𝐞𝐧𝐞𝐬/𝐬𝐮𝐞𝐫𝐭𝐞.𝐣𝐩𝐠')
𝐠𝐥𝐨𝐛𝐚𝐥.𝐨𝐫𝐚𝐜𝐢𝐨𝐧 = 𝐟𝐬.𝐫𝐞𝐚𝐝𝐅𝐢𝐥𝐞𝐒𝐲𝐧𝐜('./𝐬𝐭𝐨𝐫𝐚𝐠𝐞/𝐢𝐦𝐚𝐠𝐞𝐧𝐞𝐬/𝐨𝐫𝐚𝐜𝐢𝐨𝐧.𝐣𝐩𝐠')
𝐠𝐥𝐨𝐛𝐚𝐥.𝐫𝐨𝐬𝐚𝐬 = 𝐟𝐬.𝐫𝐞𝐚𝐝𝐅𝐢𝐥𝐞𝐒𝐲𝐧𝐜('./𝐬𝐭𝐨𝐫𝐚𝐠𝐞/𝐢𝐦𝐚𝐠𝐞𝐧𝐞𝐬/𝐫𝐨𝐬𝐚𝐬.𝐣𝐩𝐠')
𝐠𝐥𝐨𝐛𝐚𝐥.𝐫𝐞𝐟𝐫𝐚𝐧 = 𝐟𝐬.𝐫𝐞𝐚𝐝𝐅𝐢𝐥𝐞𝐒𝐲𝐧𝐜('./𝐬𝐭𝐨𝐫𝐚𝐠𝐞/𝐢𝐦𝐚𝐠𝐞𝐧𝐞𝐬/𝐫𝐞𝐟𝐫𝐚𝐧.𝐣𝐩𝐠')
𝐠𝐥𝐨𝐛𝐚𝐥.𝐥𝐢𝐧𝐤𝐬𝐣𝐩𝐠 = 𝐟𝐬.𝐫𝐞𝐚𝐝𝐅𝐢𝐥𝐞𝐒𝐲𝐧𝐜('./𝐬𝐭𝐨𝐫𝐚𝐠𝐞/𝐢𝐦𝐚𝐠𝐞𝐧𝐞𝐬/𝐋𝐢𝐧𝐤𝐬.𝐣𝐩𝐠')

𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟖𝟏𝟒𝐞𝟔𝟒𝐟𝟓𝟕𝟖𝐝𝟗𝟖𝐞𝟒𝟐𝟒𝟒𝐚𝟑𝐝.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟏 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟕𝟒𝐛𝟕𝐜𝟎𝟎𝟑𝐝𝟎𝟒𝐝𝐞𝐜𝟓𝟖𝟕𝟓𝐛𝐚𝟎.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟐 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟗𝟐𝟐𝟑𝐜𝐚𝐞𝐜𝐜𝟑𝐞𝟕𝐛𝟕𝟑𝟏𝟎𝟕𝟑𝐞𝟐.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟑 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟕𝐝𝐞𝐞𝐟𝟔𝟓𝐟𝟔𝐚𝟓𝟑𝐞𝐜𝐝𝐝𝟓𝟏𝐜𝐝𝐝.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟒 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟒𝐟𝟎𝟐𝟑𝐟𝟗𝟏𝟖𝐚𝐟𝟐𝐛𝐝𝐞𝟕𝟐𝐜𝟖𝟑𝟗.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟓 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝐚𝟑𝟒𝐞𝐛𝐚𝐝𝟒𝐜𝟗𝐛𝟓𝟗𝟔𝟑𝐜𝟖𝟐𝐟𝟏𝐚.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟔 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟒𝐞𝟔𝟗𝐟𝟔𝐜𝟒𝟖𝐝𝟗𝟗𝐟𝟔𝐜𝟏𝟏𝟕𝟒𝐚𝟗.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟕 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟗𝟓𝟏𝟐𝟕𝟓𝟖𝟎𝟑𝐟𝐚𝐚𝟕𝟓𝟒𝐚𝐟𝐟𝟎𝟏𝟎.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟖 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟗𝐟𝟕𝟔𝟓𝐞𝐚𝟑𝟖𝟔𝐚𝟗𝐝𝐝𝟏𝐚𝟓𝐟𝟖𝐞𝟓.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟗 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟎𝟏𝟏𝐛𝐞𝟗𝟕𝐟𝟖𝟎𝐟𝟏𝟗𝟐𝟖𝟔𝐞𝐞𝟒𝐜𝟕.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟏𝟎 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟗𝟖𝐛𝐞𝐜𝟑𝐜𝟔𝟔𝟏𝟒𝟗𝐟𝐞𝐞𝟎𝟗𝟑𝐚𝟑𝐟.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟏𝟏 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝐝𝟑𝐜𝟒𝟏𝟓𝟎𝟐𝟎𝟎𝐟𝐜𝐛𝐚𝟔𝐟𝐛𝟏𝟓𝐚𝐟.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟏𝟐 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝐟𝐝𝟕𝟕𝟓𝐞𝟒𝟕𝟓𝟑𝟏𝟕𝟑𝐞𝐜𝐝𝐟𝟗𝟓𝟎𝐚.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟏𝟑 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟎𝟒𝟕𝟔𝐟𝟓𝐝𝐚𝟑𝟑𝟏𝐞𝟏𝐚𝟏𝟕𝟏𝟐𝐝𝐟𝟗.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐦𝐠𝟏𝟒 = '𝐡𝐭𝐭𝐩𝐬://𝐭𝐞𝐥𝐞𝐠𝐫𝐚.𝐩𝐡/𝐟𝐢𝐥𝐞/𝟐𝐛𝐝𝐚𝟏𝟗𝐝𝐜𝐟𝐚𝟕𝟒𝟕𝟐𝟎𝟖𝟗𝐚𝟑𝐚𝟑.𝐣𝐩𝐠'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐈𝐦𝐠𝐀𝐥𝐥 = [𝐢𝐦𝐠, 𝐢𝐦𝐠𝟏, 𝐢𝐦𝐠𝟐, 𝐢𝐦𝐠𝟑, 𝐢𝐦𝐠𝟒, 𝐢𝐦𝐠𝟓, 𝐢𝐦𝐠𝟔, 𝐢𝐦𝐠𝟕, 𝐢𝐦𝐠𝟖, 𝐢𝐦𝐠𝟗, 𝐢𝐦𝐠𝟏𝟎, 𝐢𝐦𝐠𝟏𝟏, 𝐢𝐦𝐠𝟏𝟐, 𝐢𝐦𝐠𝟏𝟑, 𝐢𝐦𝐠𝟏𝟒]

//𝐄𝐧𝐥𝐚𝐜𝐞𝐬
𝐠𝐥𝐨𝐛𝐚𝐥.𝐲𝐭 = '𝐡𝐭𝐭𝐩𝐬://𝐰𝐰𝐰.𝐲𝐨𝐮𝐭𝐮𝐛𝐞.𝐜𝐨𝐦/@𝐀𝐳𝐚𝐦𝐢_𝐌𝐨𝐝𝐬'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐢𝐠 = '𝐡𝐭𝐭𝐩𝐬://𝐰𝐰𝐰.𝐢𝐧𝐬𝐭𝐚𝐠𝐫𝐚𝐦.𝐜𝐨𝐦/𝐛.𝐣𝐱𝐭𝐱𝐧𝟏𝟕'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐦𝐝 = '𝐡𝐭𝐭𝐩𝐬://𝐠𝐢𝐭𝐡𝐮𝐛.𝐜𝐨𝐦/𝐉𝐱𝐭𝐱𝐧𝟏𝟕/𝐁𝐚𝐢𝐥𝐞𝐲𝐁𝐨𝐭-𝐌𝐃'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐩𝐚𝐲𝐩𝐚𝐥 = '+𝟓𝟏𝟗𝟐𝟗𝟗𝟕𝟐𝟓𝟕𝟔'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐠𝐢𝐭 = '𝐡𝐭𝐭𝐩𝐬://𝐠𝐢𝐭𝐡𝐮𝐛.𝐜𝐨𝐦/𝐉𝐱𝐭𝐱𝐧𝟏𝟕'
𝐠𝐥𝐨𝐛𝐚𝐥.𝐧𝐧 = '𝐡𝐭𝐭𝐩𝐬://𝐜𝐡𝐚𝐭.𝐰𝐡𝐚𝐭𝐬𝐚𝐩𝐩.𝐜𝐨𝐦/𝐈𝐀𝟒𝐏𝐎𝐎𝐱𝐟𝐰𝐅𝐍𝟗𝐢𝐎𝟏𝐞𝟗𝐈𝟐𝐐𝐧𝐬' //𝐆𝐫𝐮𝐩𝐨 𝐨𝐟𝐜
𝐠𝐥𝐨𝐛𝐚𝐥.𝐂𝐮𝐫𝐢𝐨𝐬𝐢𝐭𝐲 = '𝐡𝐭𝐭𝐩𝐬://𝐜𝐡𝐚𝐭.𝐰𝐡𝐚𝐭𝐬𝐚𝐩𝐩.𝐜𝐨𝐦/𝐋𝐂𝐀𝐔𝐛𝐤𝐟𝟓𝐤𝐔𝐳𝟕𝐣𝐒𝐱𝐎𝟔𝐅𝐀𝐃𝐌𝐔' //𝐂𝐮𝐫𝐢𝐨𝐬𝐢𝐭𝐲 𝐎𝐅𝐂
𝐠𝐥𝐨𝐛𝐚𝐥.𝐡𝐚𝐜𝐡𝐢𝐤𝐨 = '𝐡𝐭𝐭𝐩𝐬://𝐜𝐡𝐚𝐭.𝐰𝐡𝐚𝐭𝐬𝐚𝐩𝐩.𝐜𝐨𝐦/𝐋𝐑𝐐𝐝𝐭𝐒𝟕𝐧𝐊𝐭𝟖𝟗𝐍𝐁𝐔𝐏𝐖𝐉𝐃𝐣𝐳𝐡' //𝐇𝐚𝐜𝐡𝐢𝐤𝐨 𝐎𝐅𝐂
𝐠𝐥𝐨𝐛𝐚𝐥.𝐋𝐨𝐛𝐨 = '𝐡𝐭𝐭𝐩𝐬://𝐜𝐡𝐚𝐭.𝐰𝐡𝐚𝐭𝐬𝐚𝐩𝐩.𝐜𝐨𝐦/𝐋𝐢𝟒𝟔𝐄𝐔𝐐𝐡𝐀𝟓𝐭𝐉𝐪𝐗𝐄𝐄𝐍𝐟𝐊𝐏𝐉𝐝' //𝐋𝐨𝐛𝐨 𝐎𝐅𝐂
𝐠𝐥𝐨𝐛𝐚𝐥.𝐧𝐧𝐧 = '𝐡𝐭𝐭𝐩𝐬://𝐜𝐡𝐚𝐭.𝐰𝐡𝐚𝐭𝐬𝐚𝐩𝐩.𝐜𝐨𝐦/𝐄𝐍𝐏𝟎𝟐𝟏𝐱𝟎𝐚𝐑𝟓𝐇𝐖𝐯𝐆𝟏𝐇𝐩𝐯𝐥𝐂𝐨' //𝐁𝐚𝐢𝐥𝐞𝐲 𝐠𝐥𝐨𝐛𝐚𝐥
𝐠𝐥𝐨𝐛𝐚𝐥.𝐜𝐡𝐚𝐧𝐧𝐞𝐥 = '𝐡𝐭𝐭𝐩𝐬://𝐰𝐡𝐚𝐭𝐬𝐚𝐩𝐩.𝐜𝐨𝐦/𝐜𝐡𝐚𝐧𝐧𝐞𝐥/𝟎𝟎𝟐𝟗𝐕𝐚𝐃𝐑𝐃𝐤𝟐𝐂𝐁𝐭𝐱𝐁𝐕𝐞𝐱𝟐𝐯𝐁𝟎𝐘' //𝐁𝐚𝐢𝐥𝐞𝐲𝐁𝐨𝐭-𝐌𝐃
𝐠𝐥𝐨𝐛𝐚𝐥.𝐧𝐧𝐧𝐧 = '𝐡𝐭𝐭𝐩𝐬://𝐜𝐡𝐚𝐭.𝐰𝐡𝐚𝐭𝐬𝐚𝐩𝐩.𝐜𝐨𝐦/𝐊𝐋𝐩𝐘𝐅𝐬𝐢𝐭𝐤𝐠𝐳𝐉𝟏𝟓𝐘𝐐𝐱𝐙𝐫𝐁𝐪𝐎' //𝐜𝐨𝐥𝐚𝐛𝐨𝐫𝐚𝐜𝐢𝐨́𝐧 𝐦𝐮𝐥𝐭𝐢 𝐛𝐨𝐭𝐬
𝐠𝐥𝐨𝐛𝐚𝐥.𝐥𝐢𝐧𝐤𝐒𝐢𝐭𝐲 = [𝐲𝐭, 𝐢𝐠, 𝐦𝐝, 𝐩𝐚𝐲𝐩𝐚𝐥, 𝐠𝐢𝐭, 𝐧𝐧]

//Raíz
global.raiz = './'
global.aniD = 'sessions/'
global.dirP = raiz//+aniD
global.authFile = join(__dirname, `sessions/`)
global.authFileRespald = join(__dirname, `sesionRespaldo/`)
global.temp = join(__dirname, 'tmp')
global.media = raiz+'media/'
global.jadibts = join(__dirname, 'jadibts/')
global.raiz = './storage/logos/Menu1.jpg'

//Reacciones De Comandos.!
global.rwait = '⏰'
global.done = '✅'
global.error = '❌'

//Cargando
global.wait = '*■□□□□ 20%*'
global.waitt = '*■■■□□ 60%*'
global.waittt = '*■■■■□ 90%*'
global.waitttt = '*■■■■■ 100%*'

//fake
global.fsizedoc = '999999'
global.fpagedoc = '9999'

//Apis
global.keysZens = ['LuOlangNgentot', 'c2459db922', '37CC845916', '6fb0eff124', 'hdiiofficial', 'fiktod', 'BF39D349845E', '675e34de8a', '0b917b905e6f']
global.keysxxx = keysZens[Math.floor(keysZens.length * Math.random())]
global.keysxteammm = ['29d4b59a4aa687ca', '5LTV57azwaid7dXfz5fzJu', 'cb15ed422c71a2fb', '5bd33b276d41d6b4', 'HIRO', 'kurrxd09', 'ebb6251cc00f9c63']
global.keysxteam = keysxteammm[Math.floor(keysxteammm.length * Math.random())]
global.keysneoxrrr = ['5VC9rvNx', 'cfALv5']
global.keysneoxr = keysneoxrrr[Math.floor(keysneoxrrr.length * Math.random())]
global.lolkeysapi = ['GataDios']
global.itsrose = ['4b146102c4d500809da9d1ff']

global.APIs = {
amel: 'https://melcanz.com',
bx: 'https://bx-hunter.herokuapp.com',
nrtm: 'https://nurutomo.herokuapp.com',
xteam: 'https://api.xteam.xyz',
nzcha: 'http://nzcha-apii.herokuapp.com',
bg: 'http://bochil.ddns.net',
fdci: 'https://api.fdci.se',
dzx: 'https://api.dhamzxploit.my.id',
bsbt: 'https://bsbt-api-rest.herokuapp.com',
zahir: 'https://zahirr-web.herokuapp.com',
zeks: 'https://api.zeks.me',
hardianto: 'https://hardianto-chan.herokuapp.com',
pencarikode: 'https://pencarikode.xyz',
LeysCoder: 'https://leyscoders-api.herokuapp.com',
adiisus: 'https://adiixyzapi.herokuapp.com',
lol: 'https://api.lolhuman.xyz',
fgmods: 'https://api-fgmods.ddns.net',
pencarikode: 'https://pencarikode.xyz',
Velgrynd: 'https://velgrynd.herokuapp.com',
rey: 'https://server-api-rey.herokuapp.com',
hardianto: 'http://hardianto-chan.herokuapp.com',
shadow: 'https://api.reysekha.xyz',
apialc: 'https://api-alc.herokuapp.com',
botstyle: 'https://botstyle-api.herokuapp.com',
neoxr: 'https://neoxr-api.herokuapp.com',
ana: 'https://anabotofc.herokuapp.com/',
kanx: 'https://kannxapi.herokuapp.com/',
dhnjing: 'https://dhnjing.xyz'
},

global.APIKeys = {
'https://api-alc.herokuapp.com': 'ConfuMods',
'https://api.reysekha.xyz': 'apirey',
'https://melcanz.com': 'F3bOrWzY',
'https://bx-hunter.herokuapp.com': 'Ikyy69',
'https://api.xteam.xyz': '5bd33b276d41d6b4',
'https://zahirr-web.herokuapp.com': 'zahirgans',
'https://bsbt-api-rest.herokuapp.com': 'benniismael',
'https://api.zeks.me': 'apivinz',
'https://hardianto-chan.herokuapp.com': 'hardianto',
'https://pencarikode.xyz': 'pais',
'https://api-fgmods.ddns.net': 'fg-dylux',
'https://leyscoders-api.herokuapp.com': 'MIMINGANZ',
'https://server-api-rey.herokuapp.com': 'apirey',
'https://api.lolhuman.xyz': 'GataDios',
'https://botstyle-api.herokuapp.com': 'Eyar749L',
'https://neoxr-api.herokuapp.com': 'yntkts',
'https://anabotofc.herokuapp.com/': 'AnaBot'
}

//Rpg
global.multiplier = 200 // Cuanto más alto, más difícil subir de nivel

global.rpg = {
emoticon(string) {
string = string.toLowerCase()
let emot = {
level: '🏆', limit: '💎', exp: '✨',
health: '❤️',
money: '💵',
potion: '🥤',
pickaxe: '⛏️' 
}

let results = Object.keys(emot).map(v => [v, new RegExp(v, 'gi')]).filter(v => v[1].test(string))
if (!results.length) return ''
else return emot[results[0][0]]
}}

global.d = new Date(new Date + 3600000)
global.locale = 'es'
global.dia = d.toLocaleDateString(locale, {weekday: 'long'})
global.fecha = d.toLocaleDateString('es', {day: 'numeric', month: 'numeric', year: 'numeric'})
global.mes = d.toLocaleDateString('es', {month: 'long'})
global.año = d.toLocaleDateString('es', {year: 'numeric'})
global.tiempo = d.toLocaleString('en-US', {hour: 'numeric', minute: 'numeric', second: 'numeric', hour12: true})

var more = String.fromCharCode(8206)
global.readMore = more.repeat(850)
  

//No muevas nada de aqui
let file = fileURLToPath(import.meta.url)
watchFile(file, () => { unwatchFile(file)
console.log(chalk.yellowBright('Se actualizo el archivo store.js'))
import(`${file}?update=${Date.now()}`)
})
